In [4]:
import pandas as pd
data_frame=pd.DataFrame()
type(data_frame)

pandas.core.frame.DataFrame

In [5]:
data=[1,2,3,4,5]
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [6]:
data2=[["abc",21],["cde",22],["werd",19]]
data_frame_2=pd.DataFrame(data2, columns=["NAME","AGE"])
data_frame_2

   NAME  AGE
0   abc   21
1   cde   22
2  werd   19

In [5]:
import turtle
def polygon(t, n, length):
    angle = 360 / n
    for i in range(n):
        t.fd(length)
        t.lt(angle)
bob = turtle.Turtle()
polygon(bob, 7, 70)